英語ネイティブの講師がすべてのクラスを担当します。日本語での説明も交え、英語が初めてのお子様が質の高い学びを得られるレッスンをいたします。

                                    幼少期の英語学習においては、教えられた言葉を繰り返して言ったり、覚えたりできても、何を言っているのか意味を理解していない、という状態が起こりがちです。私たちのレッスンでは、お子様は、英語を聞いたり、話したりして、ほとんどの時間を過ごしますが、講師に教えられたことをお子様に日本語で説明してもらうことにより、お子様が理解できていることを確認し、お子様の学びを確実なものにするよう取り組んでいます。

                                    レッスンは、主にカードを使ったアクティビティを行い、英語のフレーズの単なる暗記ではなく、基本的な英語の文章を組み立てられるようになることを目標としています。このクラスでは、話すことと聞くことに重点を置いていますが、アルファベット、フォニックス、読み書きへの導入もいたします。

                                    以下は、カードを使ったレッスンの進め方です。
                                    
                                    まず、文の一部分から始めて、全文まで学習します。お子様は、部分を学んだ後、カードに従って簡単に文章を変えることができます。
                                    例えば、まず、He is, she is, they are, I amの練習をします。その後、He is a pilot. She is a teacher.
                                    と文章にしていきます。そして最後に、He is a happy pilot. She is a cold teacher. のように、文章に形容詞を組み合わせます。